#version: 0.2
Ġ Ġ
ĠĠ Ġ
a m
n t
n am
ĠĠ ĠĠ
nam e
e r
ĠĠĠĠ ĠĠĠ
Ġ =
l e
" )
r i
a t
Ġ a
Ġ p
e l
e t
i le
ri nt
Ġp rint
a l
i n
i s
r e
_ _
g e
o r
o t
o u
Ġ #
Ġ c
Ġ f
Ġ n
Ġ {
re et
" {
. ")
d e
t ot
u m
Ġ o
ile name
ou nt
tot al
) :
d o
f ilename
g reet
i f
i t
o n
r a
s el
Ġ "
Ġ 2
Ġ w
Ġa ge
Ġn um
ount er
sel f
e x
i m
p or
Ġ name
Ġ el
Ġ is
Ġ total
Ġ greet
at h
in g
is t
Ġc ounter
Ġf or
de f
ra n
Ġ2 5
ex ist
im por
impor t
G reet
L o
S am
a s
a ge
b er
d d
d at
e nt
h ile
i on
l as
m ath
o p
p le
s e
s t
u r
} ,
} ")
Ġ 0
Ġ 3
Ġ 5
Ġ C
Ġ b
Ġ __
Ġ if
Ġ def
Ġ ran
Ġ exist
Ġ Greet
Ġ Lo
Ġ math
Ġ= =
at e
Ġa dd
Ġo p
Ġo s
do m
Ġw hile
Ġnum ber
Ġel se
Ġgreet er
Sam ple
dat a
las s
Ġran dom
ĠGreet er
ĠLo op
Ġnumber s
